_src/wiki/2017-04-01-mysql-ddl.org
# -*- coding: utf-8-unix; -*-
#+TITLE:       mysql 添加字段、删除字段、调整字段顺序
#+AUTHOR:      Bruce Asu
#+EMAIL:       bruceasu@163.com
#+DATE:        <2017-04-01 20:48>
#+filetags:    mysql database

#+LANGUAGE:    en
#+OPTIONS:     H:7 num:nil toc:nil \n:nil ::t |:t ^:nil -:nil f:t *:t <:nil

* ALTER TABLE — 更改表属性
** 添加字段：
: alter table `user_movement_log` Add column GatewayId int  not null default 0 AFTER `Regionid` (在哪个字段后面添加)

** 删除字段：
: alter table `user_movement_log` drop column Gatewayid

** 调整字段顺序：
: ALTER TABLE `user_movement_log`  CHANGE `GatewayId` `GatewayId` int not null default 0  AFTER RegionID

* mysql alter 语句用法,添加、修改、删除字段等
** 主键
: alter table tabelname add new_field_id int(5) unsigned default 0 not null auto_increment ,add primary key (new_field_id);`

** 增加一个新列
: alter table t2 add d timestamp;
: alter table infos add ex tinyint not null default '0';

** 删除列
: alter table t2 drop column c;

** 重命名列
: alter table t1 change a b integer;

** 改变列的类型
: alter table t1 change b b bigint not null;
: alter table infos change list list tinyint not null default '0';

** 重命名表
: alter table t1 rename t2;

** 加索引
#+BEGIN_EXAMPLE
mysql> alter table tablename change depno depno int(5) not null;
mysql> alter table tablename add index 索引名 (字段名1[，字段名2 …]);
mysql> alter table tablename add index emp_name (name);

#+END_EXAMPLE

** 加主关键字的索引
: mysql> alter table tablename add primary key(id);

** 加唯一限制条件的索引
:: mysql> alter table tablename add unique emp_name2(cardnumber);

** 删除某个索引
: mysql> alter table tablename drop index emp_name;

** 增加字段：
: mysql> ALTER TABLE table_name ADD field_name field_type;

** 修改原字段名称及类型：
: mysql> ALTER TABLE table_name CHANGE old_field_name new_field_name field_type;

** 删除字段：
: mysql> ALTER TABLE table_name DROP field_name;
